In [1]:
import pandas as pd
import numpy as np
import numpy_financial as npf
import seaborn as sns
import matplotlib.pyplot as plt
import statsmodels.api as sm
from statsmodels.formula.api import ols
from sklearn.model_selection import train_test_split
import warnings
warnings.filterwarnings("ignore")
from numpy import *

from ggplot import *
from scipy.stats import logistic
from sklearn.metrics import roc_curve
from sklearn.metrics import roc_auc_score
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix, mean_squared_error
from sklearn.model_selection import train_test_split
from sklearn import preprocessing
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import *
from sklearn.tree import DecisionTreeClassifier, DecisionTreeRegressor, export_graphviz
import graphviz
from sklearn.ensemble import RandomForestRegressor, RandomForestClassifier
from sklearn.svm import SVC, SVR
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler


from linearmodels.iv import IV2SLS
from scipy import stats
from scipy.stats import trim_mean #trimmed mean
from scipy.stats import * #chi2_contingency로 카이제곱통계량계산
from scipy.stats import norm

import keyword
import random

#open api 불러올 때 필요한 것
from urllib.request import urlopen #request package 설치
from bs4 import BeautifulSoup #bs4 package 설치

# 그래프에서 한글 깨지지 않기 위헤 사용함
from matplotlib import rcParams
from matplotlib import font_manager,rc

rcParams['axes.unicode_minus']=False
plt.rcParams['font.family']='Malgun Gothic'
font_name=font_manager.FontProperties(fname='c:/Windows/Fonts/malgun.ttf').get_name()
rc('font',family=font_name)

import FinanceDataReader as fdr
import plotly.graph_objects as go
import plotly.subplots as ms
import math

import tensorflow as tf

import qgrid

In [2]:
df=pd.read_csv('c:/temp/final4_20240619.csv')
df.head()

,year,metro,id,sex,age,number,education,marriage,asset,debt,income,income_d,industry,job,house,education_year
0,2020,G1,10000112,1,34,3,6,2,112000,54500,6.593,4599,F,3,2,16
1,2020,G1,10000132,2,45,2,8,2,42500,17500,17.720,15257,J,2,3,21
2,2020,G1,10000162,2,73,1,2,3,5712,0,0.908,725,T,4,2,6
3,2020,G1,10000182,1,58,2,4,2,14870,0,2.748,2431,C,5,2,12
4,2020,G1,10000192,2,27,1,4,1,814,0,1.015,893,R,2,3,12

In [4]:
df1=df[['education_year','age','income']]
df1.head()

   education_year  age  income
0              16   34   6.593
1              21   45  17.720
2               6   73   0.908
3              12   58   2.748
4              12   27   1.015

In [5]:
edu=df1[['age','education_year']]
X=edu.values #(.values: 앞이 행렬로 바뀐다)

In [6]:
Y=df1['income'].values

In [7]:
woow=(X.T@Y).T@np.linalg.inv(X.T@X)
print(woow)

[-11.85222854 451.5541953 ]

In [8]:
#q14

In [9]:
df.head()

,year,metro,id,sex,age,number,education,marriage,asset,debt,income,income_d,industry,job,house,education_year
0,2020,G1,10000112,1,34,3,6,2,112000,54500,6.593,4599,F,3,2,16
1,2020,G1,10000132,2,45,2,8,2,42500,17500,17.720,15257,J,2,3,21
2,2020,G1,10000162,2,73,1,2,3,5712,0,0.908,725,T,4,2,6
3,2020,G1,10000182,1,58,2,4,2,14870,0,2.748,2431,C,5,2,12
4,2020,G1,10000192,2,27,1,4,1,814,0,1.015,893,R,2,3,12

In [10]:
pd.value_counts(df['sex'])

1    726
2    274
Name: sex, dtype: int64

In [11]:
pd.value_counts(df['marriage'])

2    647
3    127
1    118
4    108
Name: marriage, dtype: int64

In [13]:
pd.value_counts(df['job'])

2    143
3    123
8    101
9     93
7     82
5     62
4     59
6     32
1     20
A      3
Name: job, dtype: int64

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            1000 non-null   int64
 1   metro           1000 non-null   object
 2   id              1000 non-null   int64
 3   sex             1000 non-null   int64
 4   age             1000 non-null   int64
 5   number          1000 non-null   int64
 6   education       1000 non-null   int64
 7   marriage        1000 non-null   int64
 8   asset           1000 non-null   int64
 9   debt            1000 non-null   int64
 10  income          1000 non-null   float64
 11  income_d        1000 non-null   int64
 12  industry        718 non-null    object
 13  job             718 non-null    object
 14  house           1000 non-null   int64
 15  education_year  1000 non-null   int64
dtypes: float64(1), int64(12), object(3)
memory usage: 125.1+ KB

In [15]:
2+6+10+16

34